# _*_coding:cp1251_*_
from DZ.Raschet import kalkulajtor
from DZ.Geometrija import geometrija

print("*************************************************************************************************************"
      "******************************************************")
print("\n                     В данном конструкторе Вы сможете воспользоваться калькулятором для вычисления "
      "простейших\n"
      "               математических задач, геометрических решений!")
print("\n*************************************************************************************************************"
      "******************************************************")
print("Выбирите действие: Калькулятор - 'K', Геометрия - 'G', Возраст - 'V'")
comanda = input("Введите команду: ")

if comanda == "K":
    kalkulajtor()
elif comanda == "G":
    geometrija()
