# _*_coding:cp1251_*_
def kalkulajtor():
    def summ(a, b):  # Функция сложения
        return a + b  # Вывод результата
    def vysh(a, b):  # Функция вычитания
        return a - b  # Вывод результата
    def pro(a, b):  # Функция сложения
        return a * b  # Вывод результата
    def raz(a, b):  # Функция сложения
        return a / b  # Вывод результата
    print("**********************************************************************************************************")
    print("     Калькулятор     "*5)
    print("**********************************************************************************************************")
    while True:  # Бесконечный цикл пользования
        a = float(input("Введите число 1: "))  # пользователь вводит число 1
        b = float(input("Введите число 2: "))  # пользователь вводит число 2
        c = input("Введите действие: ")  # пользователь вводит операцию ( +, -, *, / )
        # для выхода из калькулятора нажмите "s"
        if c == "+":
            print("Результат: ", summ(a, b))
        elif c == "-":
            print("Результат: ", vysh(a, b))
        elif c == "*":
            print("Результат: ", pro(a, b))
        elif c == "/":
            print("Результат: ", raz(a, b))
        elif c == "s":
            break